package com.lzy.rule;

import com.lzy.demo.BaZi;
import com.lzy.demo.CommonAlgorithm;
import com.lzy.domain.AnalyzeResult;

/**
 *  五行精纪规则
 * Created by bukeyan on 2017/6/18.
 */
public class WuXingJingJiRule  implements BaseRule{

    @Override
    public Object matchRule(BaZi bazi, CommonAlgorithm commonAlgorithm) {
        def mapResult = [:]
        def mapRule = [:]
        def matchStr = ""
        def ruleValue ;
        def tempShow=""

        def  nianGan = bazi.getNianGan()
        def nianZhi = bazi.getNianZhi()
        def nianZhu = bazi.getNianZhu()

        def yueGan = bazi.getYueGan()
        def yueZhi =bazi.getYueZhi()
        def yueZhu = bazi.getYueZhu()

        def riGan = bazi.getRiGan()
        def riZhi = bazi.getRiZhi()
        def riZhu = bazi.getRiZhu()

        def shiGan = bazi.getShiGan()
        def shiZhi = bazi.getShiZhi()
        def shiZhu = bazi.getShiZhu()

        def listMingGan = bazi.getListMingGan()
        def listMingZhi = bazi.getListMingZhi()
        def listMingZhu = bazi.getListMingZhu()

        def luZhi = commonAlgorithm.getLuZhi(nianGan);

        //第一卷
        def mapNaYinLun=[
                "甲子":[
                        "戊申":"甲子从革之金，其气散，得戊申土相之，则吉。戊申乃金临官之地，土者更旺于子，必能生成"
                        ,"癸巳":"甲子从革之金，其气散，得癸巳水相之，则吉。癸巳系金生于巳，水旺于子，纳音各有所归，又为朝元禄"
                        ,"丁卯":"忌丁卯之火"
                        ,"丁酉":"忌丁酉之火"
                        ,"戊午":"忌戊午之火"
                ]

                ,"乙丑":[
                         "己丑":"乙丑自库之金，火不能克。盖退藏之金，苟无刑害冲破，未有不显荣者.独忌己丑之火"
                        ,"戊午":"乙丑自库之金，火不能克。盖退藏之金，苟无刑害冲破，未有不显荣者.独忌戊午之火"
                        ,"己未":"乙丑自库之金，火不能克。盖退藏之金，苟无刑害冲破，未有不显荣者.独忌己未之火"

                ]

                ,"丙寅":[
                         "甲寅":"丙寅赫牺之火，无水制之，则为燔灼炎烈之患，水不可遇，独爱甲寅之水，就位济之，又名朝元禄。"
                ]

                ,"丁卯":[
                         "乙卯":"丁卯伏明之火，气弱宜木生之，遇水则凶，乙卯水最毒。"
                         ,"乙酉":"丁卯伏明之火，气弱宜木生之，遇水则凶，乙酉水最毒。"
                ]

                ,"壬申":[
                         "丙申":"壬申临官之金，利见水土，若丙之火，则为灾害。"
                         ,"丙寅":"壬申临官之金，利见水土，若丙寅之火，则为灾害。"
                         ,"戊午":"壬申临官之金，利见水土，若戊午之火，则为灾害。"
                ]

                ,"癸酉":[
                        "丁酉":"癸酉坚成之金，火死于酉，见火何伤，惟忌丁酉火，就位克之。"
                ]

                ,"甲戌":[
                         "壬戌":"甲戌自库之火，不嫌众水，惟忌壬戌，所谓墓中受克，其患难逃。 "
                ]

                ,"乙亥":[
                         "己亥":"乙亥伏明之火，其气湮欎而不发，借己亥木生之，则精神旺相。"
                         ,"辛卯":"乙亥伏明之火，其气湮欎而不发，借辛卯木生之，则精神旺相。"
                         ,"己巳":"乙亥伏明之火，其气湮欎而不发，借己巳木生之，则精神旺相。"
                         ,"壬午":"乙亥伏明之火，其气湮欎而不发，借壬午木生之，则精神旺相。"
                         ,"癸未":"乙亥伏明之火，其气湮欎而不发，借癸未木生之，则精神旺相。"
                         ,"癸巳":"癸巳水，有之则不吉。"
                         ,"癸亥":"癸亥水，有之则不吉。"
                         ,"丙午":"丙午水，有之则不吉。"
                ]

                ,"丙子":[
                         "庚子":"丙子流衍之水，不忌众土，惟嫌庚子，乃旺中逢鬼，不祥莫大焉。 "
                ]

                ,"丁丑":[
                         "辛未":"丁丑福聚之水，忌辛未相刑破也。"
                         ,"丙辰":"丁丑福聚之水，忌丙辰相刑破也。"
                         ,"丙戌":"丁丑福聚之水，忌丙戌相刑破也。"
                ]

                ,"戊寅":[
                         "己亥":"戊寅受伤之土，最为无力，要生旺火，以资其气，忌己亥木克之，主短夭之凶。"
                         ,"庚寅":"戊寅受伤之土，最为无力，要生旺火，以资其气，忌庚寅木克之，主短夭之凶。"
                         ,"辛卯":"戊寅受伤之土，最为无力，要生旺火，以资其气，忌辛卯木克之，主短夭之凶。"
                ]

                ,"己卯":[
                         "丁卯":"己卯自死之土，抑有甚焉，贵得丁卯之火，由合而来，以致其福。"
                         ,"甲戌":"己卯自死之土，抑有甚焉，贵得甲戌之火，由合而来，以致其福。"
                         ,"乙亥":"己卯自死之土，抑有甚焉，贵得乙亥之火，由合而来，以致其福。"
                         ,"己未":"己卯自死之土，抑有甚焉，贵得己未之火，由合而来，以致其福。"
                ]

                ,"庚辰":[
                         "甲辰":"庚辰气聚之金，不用火制，其器自成，火盛反丧其器，病绝火无害。若甲辰火，恶不可言，亦不能克众木，益我气亦繁耳。"
                         ,"乙巳":"庚辰气聚之金，不用火制，其器自成，火盛反丧其器，病绝火无害。若乙巳火，恶不可言，亦不能克众木，益我气亦繁耳。"
                ]

                ,"辛巳":[
                         "丙寅":"辛巳自生之金，精神具足，体气完备，炎烈炽火而不忌，忌丙寅之火，盖金绝于寅而气散，复见生旺之火，焉可当之。"
                         ,"乙巳":"辛巳自生之金，精神具足，体气完备，炎烈炽火而不忌，忌乙巳之火，盖金生于巳而不能生而气散，复见生旺之火，焉可当之。"
                         ,"戊午":"辛巳自生之金，精神具足，体气完备，炎烈炽火而不忌，忌戊午之火，盖金败于午而气散，复见生旺之火，焉可当之。"
                ]

                ,"壬午":[
                         "甲午":"壬午柔和之木，枝干微弱，木能生火，却忌见火多，多则烬矣。虽生旺之金，亦不能伤，盖金就我败，得金反贵，水土盛者亦贵，惟忌甲午金伤之。"

                ]


                ,"癸未":[
                         "庚戌":"癸未自库之木，生旺尤佳，虽乙丑金不能冲破，各归其根，而不相犯，忌庚戌金。"
                         ,"乙未":"癸未自库之木，生旺尤佳，虽乙丑金不能冲破，各归其根，而不相犯，忌乙未金。"
                ]


                ,"甲申":[
                         "戊申":"甲申者自生之水，其气流衍，宜有所贵，亦藉金生，不忌众土，特嫌戊申之土。"
                         ,"庚子":"甲申者自生之水，其气流衍，宜有所贵，亦藉金生，不忌众土，特嫌庚子之土。"
                ]


                ,"乙酉":[
                         "己酉":"乙酉自败之水，假众金以相之，盖我气既弱，藉母以育，忌己酉之土，则夭折穷贱"
                         ,"乙卯":"乙酉自败之水，假众金以相之，盖我气既弱，藉母以育，忌乙卯之土，则夭折穷贱"
                         ,"戊申":"乙酉自败之水，假众金以相之，盖我气既弱，藉母以育，忌戊申之土，则夭折穷贱"
                         ,"庚子":"乙酉自败之水，假众金以相之，盖我气既弱，藉母以育，忌庚子之土，则夭折穷贱"
                         ,"辛丑":"乙酉自败之水，假众金以相之，盖我气既弱，藉母以育，忌辛丑之土，则夭折穷贱"
                ]


                ,"丁亥":[
                         "己亥":"丁亥临官之土，木不能克，嫌金多，须得火以生救之乃吉，忌己亥之木。"
                         ,"辛卯":"丁亥临官之土，木不能克，嫌金多，须得火以生救之乃吉，忌辛卯之木。"
                ]


                ,"己丑":[
                         "丙寅":"己丑水中之火，又曰神龙之火，遇水方贵，为六气之君可也。 " +
                                 "五行要论云：己丑为天将之火，又为天乙本家，含威福光厚之气，发越峻猛，贵极乘之，为将德，为魁名，而建功。" +
                                 "烛神经云：己丑胎养之火，其气渐隆，若遇丙寅戊午之火助之，可成济物之功。"
                         ,"戊午":"烛神经云：己丑胎养之火，其气渐隆，若遇丙寅戊午之火助之，可成济物之功。"
                ]


                ,"壬辰":[
                         "壬辰":"壬辰自库之水，若池沼水积之地，忌金来决破，若再见壬辰，是谓自刑，别辰无咎，遇多水土皆喜"
                         ,"壬戌":"壬辰自库之水，若池沼水积之地，忌金来决破，遇多水土皆喜，惟畏壬戌"
                         ,"癸亥":"壬辰自库之水，若池沼水积之地，忌金来决破，遇多水土皆喜，惟畏癸亥"
                         ,"丙子":"壬辰自库之水，若池沼水积之地，忌金来决破，遇多水土皆喜，惟畏丙子"
                ]


                ,"甲午":[
                         "丁卯":"甲午自败之金，亦曰强悍之金，遇火生旺，其器乃成，忌丁卯之火，凶。"
                         ,"丁酉":"甲午自败之金，亦曰强悍之金，遇火生旺，其器乃成，忌丁酉之火，凶。"
                         ,"戊子":"甲午自败之金，亦曰强悍之金，遇火生旺，其器乃成，忌戊子之火，凶。"
                ]


                ,"乙未":[
                         "己未":"乙未偏库之金，亦欲火制，而土生之，则福壮气聚，忌己未之火。"
                         ,"丙申":"乙未偏库之金，亦欲火制，而土生之，则福壮气聚，忌丙申之火。"
                         ,"丁酉":"乙未偏库之金，亦欲火制，而土生之，则福壮气聚，忌丁酉之火。"
                ]


                ,"丙申":[
                         "甲申":"丙申自病之火，其气极微，假木相助，其气方生，忌甲申之水。"
                         ,"乙酉":"丙申自病之火，其气极微，假木相助，其气方生，忌乙酉之水。"
                         ,"甲寅":"丙申自病之火，其气极微，假木相助，其气方生，忌甲寅之水。"
                         ,"乙卯":"丙申自病之火，其气极微，假木相助，其气方生，忌乙卯之水。"
                ]


                ,"丁酉":[
                         "甲申":"丁酉自死之火，其气极微，假木相助，其气方生，忌甲申之水。"
                         ,"乙酉":"丁酉自死之火，其气极微，假木相助，其气方生，忌乙酉之水。"
                         ,"甲寅":"丁酉自死之火，其气极微，假木相助，其气方生，忌甲寅之水。"
                         ,"乙卯":"丁酉自死之火，其气极微，假木相助，其气方生，忌乙卯之水。"
                ]


                ,"己亥":[
                         "辛亥":"己亥自生之木，根本繁盛，不忌众金，惟嫌辛亥之金"
                         ,"辛巳":"己亥自生之木，根本繁盛，不忌众金，惟嫌辛巳之金"
                         ,"癸酉":"己亥自生之木，根本繁盛，不忌众金，惟嫌癸酉之金"
                         ,"己卯":"己亥自生之木，根本繁盛，不忌众金，若见己卯土，未有不大贵。"
                         ,"丁未":"己亥自生之木，根本繁盛，不忌众金，若见丁未水，未有不大贵。"
                         ,"癸未":"己亥自生之木，根本繁盛，不忌众金，若见癸未木，未有不大贵。"
                ]

                ,"庚子":[
                         "壬申":"庚子厚德之土，能克众水,不忌他木，盖木至子无气，若遇壬申之金，谓之名位禄，其贵必矣。"
                ]

                ,"癸卯":[
                          "丙寅":"三命纂局云：癸卯自胎之金，若逢丙寅炉中之火不为鬼，以胎金炉中成器，必有高达。"
                         ,"丁卯":"三命纂局云：癸卯自胎之金，若逢丁卯炉中之火不为鬼，以胎金炉中成器，必有高达。"
                ]

                ,"甲辰":[
                         "戊辰":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，若见戊辰木生之为贵格"
                         ,"戊戌":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，若见戊戌木生之为贵格"
                         ,"壬辰":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，忌壬辰壬戌丙午丁未水最毒。"
                         ,"壬戌":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，忌壬戌水最毒。"
                         ,"丙午":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，忌丙午水最毒。"
                         ,"丁未":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，忌丁未水最毒。"
                ]

                ,"己酉":[
                          "丁卯":"己酉自败之土，其气不足，藉火以相助之。见丁卯火则吉"
                         ,"丁酉":"己酉自败之土，其气不足，藉火以相助之。见丁酉火则吉"
                         ,"辛卯":"己酉自败之土，其气不足，藉火以相助之。切忌死绝，畏辛卯木，灾蹇夭折。"
                         ,"辛酉":"己酉自败之土，其气不足，藉火以相助之。切忌死绝，畏辛酉木，灾蹇夭折。"
                ]

                ,"甲寅":[
                          "壬寅":"甲寅自病之水，虽然病，土不能克，盖干支二木，可以制土，若见壬寅之金则为优裕。"
                         ,"癸卯":"甲寅自病之水，虽然病，土不能克，盖干支二木，可以制土，若见癸卯之金则为优裕。"
                ]

                ,"乙卯":[
                         "壬寅":"乙卯自死之水，虽然死，土不能克，盖干支二木，可以制土，若见壬寅之金则为优裕。"
                        ,"癸卯":"乙卯卯自死之水，虽然死，土不能克，盖干支二木，可以制土，若见癸卯之金则为优裕。"
                ]

               ,"戊午":[
                         "壬寅":"乙卯自死之水，虽然死，土不能克，盖干支二木，可以制土，若见壬寅之金则为优裕。"
                        ,"癸卯":"乙卯卯自死之水，虽然死，土不能克，盖干支二木，可以制土，若见癸卯之金则为优裕。"
                ]

               ,"乙卯":[
                         "丙午":"戊午自旺之火，居离明之方，旺相之地，其气极盛，他水无伤，忌丙午天上之水。"
                        ,"丁未":"戊午自旺之火，居离明之方，旺相之地，其气极盛，他水无伤，忌丁未天上之水。"
                ]

               ,"己未":[
                         "丙午":"己未偏库之火，居离明之方，旺相之地，其气极盛，他水无伤，忌丙午天上之水。"
                        ,"丁未":"己未偏库之火，居离明之方，旺相之地，其气极盛，他水无伤，忌丁未天上之水。"
                ]

               ,"庚申":[
                         "甲申":"庚申金居木上，因金以成器，忌再见金，致毁其器，若见甲申水则入格也。"
                        ,"乙酉":"庚申金居木上，因金以成器，忌再见金，致毁其器，若见乙酉水则入格也。"
                ]


               ,"辛酉":[
                         "甲申":"辛酉金居木上，因金以成器，忌再见金，致毁其器，若见甲申水则入格也。"
                        ,"乙酉":"辛酉金居木上，因金以成器，忌再见金，致毁其器，若见乙酉水则入格也。"
                        ,"癸卯":"辛酉失位之木，木因金乡乘之者，涉世多艰，惟对以癸卯金，则刚柔相济，挺拔出群，决取巍科。"
                ]


        ]
        ruleValue= mapNaYinLun.get(nianZhu)
        if (ruleValue!=null) {
            if (ruleValue.containsKey(shiZhu)) {
                mapResult["第一卷,${nianZhu}人${shiZhu}时"]= ruleValue.get(shiZhu)
            }
            if (ruleValue.containsKey(riZhu)) {
                mapResult["第一卷,${nianZhu}人${riZhu}日"]=ruleValue.get(riZhu)
            }
        }



        //五虎遁禄干
        def mapDunLuGan=["甲":"丙","乙":"己","丙":"癸","丁":"丙"
                    ,"戊":"丁","己":"庚",
                    "庚":"甲","辛":"丁","壬":"辛","癸":"甲"]
        //天乙贵人
        def mapTianYi=["甲":"丑未" ,"戊":"丑未" ,"庚":"丑未",
                       "乙":"子申" ,"己":"子申" ,
                       "丙":"亥酉" ,"丁":"亥酉" ,
                       "壬":"巳卯" ,"癸":"巳卯" ,
                       "辛":"午寅"]
        //马
        def mapMa=[
                "寅":"申" ,"午":"申" ,"戌":"申",
                "申":"寅" ,"子":"寅" ,"辰":"寅",
                "巳":"亥" ,"酉":"亥" ,"丑":"亥",
                "亥":"巳" ,"卯":"巳" ,"未":"巳"]

        //截杀
        def mapJieSha=[
                "寅":"亥" ,"午":"亥" ,"戌":"亥",
                "申":"巳" ,"子":"巳" ,"辰":"巳",
                "巳":"寅" ,"酉":"寅" ,"丑":"寅",
                "亥":"申" ,"卯":"申" ,"未":"申"]



        //荣神格
        matchStr = yueZhi+riGan+shiGan
        def rongshenge = [
                "寅甲乙","寅乙甲","卯甲乙","卯乙甲",
                "巳丙丁","巳丁丙","午丙丁","午丁丙",
                "申庚辛","申辛庚","酉庚辛","酉辛庚",
                "亥壬癸","亥癸壬","子壬癸","子癸壬",
                "辰戊己","辰己戊","戌戊己","戌己戊",
                "丑戊己","丑己戊","未戊己","未己戊"
        ]

        if (rongshenge.contains(matchStr)) {
            mapResult["荣神格"]="春甲乙日时、夏丙丁日时、秋庚辛日时、冬壬癸日时、四季戊己日时 主人心明，日时全见者足寿，富贵多权。（神白经）"
        }

        //干神二字连格
        def erzilian = [
                ["甲乙","乙甲"],
                ["丙丁","丁丙"],
                ["庚辛","辛庚"],
                ["壬癸","癸壬"],
                ["戊己","己戊"]
        ]

        erzilian.each{dataList->
            if (dataList.contains(nianGan+yueGan) && dataList.contains(riGan+shiGan)) {
                mapResult["干神二字连格"]="如甲乙或丙丁两字分四柱也，然须五行不杂，乃贵。（鬼谷遗文）"
            }
        }

        //【喜神】
        def xishen = [
                "甲壬癸",
                "甲癸壬",
                "乙壬癸",
                "乙癸壬",

                "丙甲乙",
                "丙乙甲",
                "丁甲乙",
                "丁乙甲",

                "戊丙丁",
                "戊丁丙",
                "己丙丁",
                "己丁丙",

                "庚戊己",
                "庚己戊",
                "辛戊己",
                "辛己戊",

                "壬庚辛",
                "壬辛庚",
                "癸庚辛",
                "癸辛庚"
        ]
        matchStr = nianGan+riGan+shiGan
        if (xishen.contains(matchStr)) {
            mapResult["喜神"]="盖取十干遇生己之位也，谓甲遇壬见癸之类，水能生木，余准此，若人遇之，主有大福禄也。（三命铃）"
        }

        //【连珠粹美格】
        def lianzhuge = [
                "甲丙辛己",
                "甲丙戊庚",
                "甲己辛癸",
                "甲辛庚丙",
                "甲辛癸丙",

                "乙庚壬甲",
                "乙庚丁己",
                "乙癸丁壬",
                "乙庚丁辛",
                "乙戊甲癸",
                "乙戊甲庚",

                "丙戊癸辛",
                "丙辛癸乙",
                "丙戊庚壬",
                "丙癸壬戊",
                "丙乙丁辛",

                "丁己辛壬",
                "丁癸壬己",
                "丁己癸乙",
                "丁乙己戊",
                "丁壬己辛",

                "戊癸丁乙",
                "戊庚壬甲",
                "戊庚乙癸",

                "己辛甲癸",
                "己甲丙戊",
                "己甲丁壬",
                "己甲丁辛",
                "己辛癸乙",

                "庚乙丁己",
                "庚壬甲丙",
                "庚丁丙壬",

                "辛癸乙丙",
                "辛丙庚戊",
                "辛壬丙甲",
                "辛癸乙丁",
                "辛丙丁癸",

                "壬甲丙戊",
                "壬己戊甲",
                "壬丁己辛",

                "癸戊庚壬",
                "癸乙丁己",
                "癸戊己乙",
                "癸戊丙乙"
        ]

        matchStr = nianGan+yueGan+riGan+shiGan
        if (lianzhuge.contains(matchStr)) {
            mapResult["连珠粹美格"]="年月日时,一句唤就者为贵，更有吉杀，定为卿相。（广信集）"+matchStr
        }


        //【官卿】
        def guanqing = [
                "甲丙戊":"甲随丙戊官卿泰",
                "乙丁己":"乙见丁己禄还生",
                "丙戊庚":"丙会戊庚年称遂",
                "丁己辛":"丁到己辛事皆成",
                "戊庚壬":"戊入庚壬门有庆",
                "己辛癸":"己逢辛癸职迁荣",
                "庚壬甲":"庚迁壬甲财丰足",
                "辛癸乙":"辛逢癸乙命先升",
                "壬甲丙":"壬逢甲丙无不喜",
                "癸乙丁":"癸入乙丁命高亨"
        ]
        matchStr = nianGan+riGan+shiGan
        if (guanqing.containsKey(matchStr)) {
            mapResult["官卿"]=guanqing.get(matchStr)+"此为有福运相迎。（八字金书）"
        }

        //【相合禄】
        mapRule=["甲":"己亥","乙":"庚戌","丙":"辛巳","丁":"壬午"
                 ,"戊":"癸巳","己":"甲午",
                 "庚":"乙巳","辛":"丙辰","壬":"丁亥","癸":"戊子"]
        ruleValue= mapRule.get(nianGan)
        if (shiZhu==ruleValue) {
            mapResult["【相合禄】时柱"]="禄若会见则富贵，相合则奋迅"
        }
        if (riZhu==ruleValue) {
            mapResult["【禄头财】日柱"]="禄若会见则富贵，相合则奋迅"
        }

        //【食神带禄】
        mapRule=["甲":"己亥","乙":"庚戌","丙":"辛巳","丁":"壬午"
                 ,"戊":"癸巳","己":"甲午",
                 "庚":"乙巳","辛":"丙辰","壬":"甲寅","癸":"戊子"]
        ruleValue= mapRule.get(nianGan)
        if (shiZhu==ruleValue) {
            mapResult["【相合禄】时柱"]="禄若会见则富贵，相合则奋迅"
        }
        if (riZhu==ruleValue) {
            mapResult["【禄头财】日柱"]="禄若会见则富贵，相合则奋迅"
        }

        //【名位禄】
        def mingweilu = ["甲丙寅","乙丁卯","庚壬申","辛癸酉"]
        matchStr = nianGan+shiZhu
        if (mingweilu.contains(matchStr)) {
            mapResult["【名位禄】时柱"]="凡禄上带食神者是，如甲人见丙寅，谓之名位禄，皆为贵格，余仿此。（林开五命）"
        }
        matchStr = nianGan+riZhu
        if (mingweilu.contains(matchStr)) {
            mapResult["【名位禄】日柱"]="凡禄上带食神者是，如甲人见丙寅，谓之名位禄，皆为贵格，余仿此。（林开五命）"
        }

        //【生成禄】
        def shengchenglu = ["甲甲寅","乙乙卯","丙丁巳","丁戊午","戊丁巳","己戊午",
                            "庚庚申","辛辛酉","壬癸亥","癸壬子"]
        matchStr = nianGan+shiZhu
        if (shengchenglu.contains(matchStr)) {
            mapResult["【生成禄】时柱"]=matchStr
        }
        matchStr = nianGan+riZhu
        if (shengchenglu.contains(matchStr)) {
            mapResult["【生成禄】日柱"]=matchStr
        }

        //【真禄】五虎遁得到禄位天干,又得到此天干的禄位
        def zhenlu=["甲":"丙巳","乙":"己午","丙":"癸子","丁":"丙巳"
                    ,"戊":"丁午","己":"庚申",
                    "庚":"甲寅","辛":"丁午","壬":"辛酉","癸":"甲寅"]
        def zhenluValue = zhenlu.get(nianGan);
        if (listMingGan.contains(zhenluValue[0])&&listMingZhi.contains(zhenluValue[1])) {
            mapResult["【真禄】"]="更带福神，可作贵显科甲之格"+nianGan+zhenluValue
        }

        //【禄头财】
        mapRule=["甲":"戊寅","乙":"己卯","丙":"辛巳","丁":"庚午"
                    ,"戊":"癸巳","己":"壬午",
                    "庚":"甲申","辛":"乙酉","壬":"丁亥","癸":"丙子"]
        ruleValue= mapRule.get(nianGan);
        if (shiZhu==ruleValue) {
            mapResult["【禄头财】时柱"]="主人富有声望。古诗云：禄生于絪缛，因财反有名，君子荣显禄，常人主丰盈。"
        }
        if (riZhu==ruleValue) {
            mapResult["【禄头财】日柱"]="主人富有声望。古诗云：禄生于絪缛，因财反有名，君子荣显禄，常人主丰盈。"
        }


        //【禄头鬼】
        mapRule=["甲":"庚寅","乙":"辛卯","丙":"癸巳","丁":"壬午"
                 ,"戊":"乙巳","己":"甲午",
                 "庚":"丙申","辛":"丁酉","壬":"己亥","癸":"戊子"]
        ruleValue= mapRule.get(nianGan)
        if (shiZhu==ruleValue) {
            mapResult["【禄头鬼】时柱"]="又名赤舌杀，君子主甲科，常人口舌刑责，若别有贵救，主家世超越，三代富有，行年太岁遇之，主有灾。（广信录）"
        }
        if (riZhu==ruleValue) {
            mapResult["【禄头鬼】日柱"]="又名赤舌杀，君子主甲科，常人口舌刑责，若别有贵救，主家世超越，三代富有，行年太岁遇之，主有灾。（广信录）"
        }

        //【禄盈天府格】
        mapRule=["甲":"丙寅巳","乙":"己卯午","丙":"癸巳子","丁":"丙午巳"
                    ,"戊":"丁巳午","己":"庚午申",
                    "庚":"甲申寅","辛":"丁酉午","壬":"辛亥酉","癸":"甲子寅"]
        ruleValue= mapRule.get(nianGan)
        if (listMingZhu.contains(ruleValue[0,1])&&listMingZhi.contains(ruleValue[2])) {

            mapResult["【禄盈天府格】"]="福禄兼足,稍有福助之，五品之贵，一云重重福禄主富盛"
        }

        //【旬中禄格】
        if (listMingZhi.contains(luZhi)) {

            for(i in 0..3){
                if (luZhi==listMingZhi[i]&& commonAlgorithm.isYiXun(nianZhu,listMingZhu[i])) {
                    mapResult["【旬中禄格】"]="福禄兼足,稍有福助之，五品之贵，一云重重福禄主富盛"
                }
            }
        }

        //【暗禄格】五虎遁禄双六合
        mapRule=["甲":"辛亥","乙":"甲戌","丙":"戊申","丁":"辛未"
                 ,"戊":"壬申","己":"乙未",
                 "庚":"己巳","辛":"壬辰","壬":"丙寅","癸":"己丑"]
        ruleValue= mapRule.get(nianGan)
        tempShow ="此是上清暗合禄，不因师指若何知。${nianGan}人${ruleValue}"
        if (shiZhu==ruleValue) {
            mapResult["【暗禄格】时柱"]=tempShow
        }
        if (riZhu==ruleValue) {
            mapResult["【暗禄格】日柱"]=tempShow
        }

        //【天雄禄】甲人数至戊是五数，不必求戊，戊禄在巳，见巳即名天雄禄，更正禄加之为入格。（马子才命格）
        mapRule=["甲":"巳","乙":"午","丙":"申","丁":"酉"
                 ,"戊":"亥","己":"子",
                 "庚":"寅","辛":"卯","壬":"巳","癸":"午"]
        ruleValue= mapRule.get(nianGan)
        if (listMingZhi.contains(ruleValue)&& listMingZhi.contains(luZhi)) {
            mapResult["【天雄禄】"]="甲人数至戊是五数，不必求戊，戊禄在巳，见巳即名天雄禄，更正禄加之为入格。（马子才命格）"
        }

        //【天禄贵神】太岁本干不见禄，取五虎元遁，至禄上看得何干，真干见天乙贵神，而贵人所坐之干，复得贵于禄上者是也
        def dunLuShangGan = mapDunLuGan.get(nianGan)
        if (listMingGan.contains(dunLuShangGan)) {

            def tianyi = mapTianYi.get(dunLuShangGan)
            for(i in 0..1){
                if (listMingZhi.contains(tianyi[i])) {
                    for(j in 0..3){
                        if (tianyi[i]==listMingZhi[j]) {
                            //获取贵人所坐之干
                            if (mapTianYi.get(listMingGan[j]).contains(luZhi)) {
                                mapResult["【天禄贵神】"]="如更入格，贵极一品，常格得之，不下三品。（玉霄宝鉴）"
                            }

                        }
                    }
                }
            }


        }

        //【禄堂】
        def lutang = ["甲甲戌","乙乙酉","丙丙申","丁丁未","戊戊午","己己巳","庚庚辰",
                      "辛辛卯","辛辛丑","壬壬寅","壬壬子","癸癸亥"]

        matchStr = nianGan+shiZhu
        if (lutang.contains(matchStr)) {
            mapResult["【禄堂】时柱"]="若更得诸位福神助发，必须大贵（李虚中书）"+ nianGan+"人"+shiZhu
        }
        matchStr = nianGan+riZhu
        if (lutang.contains(matchStr)) {
            mapResult["【禄堂】日柱"]="若更得诸位福神助发，必须大贵（李虚中书）"+ nianGan+"人"+riZhu
        }

        mapResult;
    }
}