package com.lzy.core


/**
 *  神煞相关的算法
 * Created by bukeyan on 2017/6/18.
 */
class ShenShaAlgorithm {


    /**
     *  年柱地支
     *
     */
    //孤辰
    static def mapGuChen=[
            "亥":"寅",
            "子":"寅",
            "丑":"寅",

            "寅":"巳",
            "卯":"巳",
            "辰":"巳",

            "巳":"申",
            "午":"申",
            "未":"申",

            "申":"亥",
            "酉":"亥",
            "戌":"亥"
    ]

    //寡宿
    static def mapGuaSu=[
            "亥":"戌",
            "子":"戌",
            "丑":"戌",

            "寅":"丑",
            "卯":"丑",
            "辰":"丑",

            "巳":"辰",
            "午":"辰",
            "未":"辰",

            "申":"未",
            "酉":"未",
            "戌":"未"

    ]

    //大耗，地支对冲的左右两支
    static def mapDaHao=[
            "亥":["辰","午"],
            "子":["巳","未"],
            "丑":["午","申"],

            "寅":["未","酉"],
            "卯":["申","戌"],
            "辰":["酉","亥"],

            "巳":["戌","子"],
            "午":["亥","丑"],
            "未":["子","寅"],

            "申":["丑","卯"],
            "酉":["寅","辰"],
            "戌":["卯","巳"]

    ]

    //驿马
   static def mapYiMa=[
           "申":"寅",
           "子":"寅",
           "辰":"寅",

           "亥":"巳",
           "卯":"巳",
           "未":"巳",

           "寅":"申",
           "午":"申",
           "戌":"申",

           "巳":"亥",
           "酉":"亥",
           "丑":"亥"
    ]

    //劫杀-五行绝地
    static def jiesha=[
            "申":"巳",
            "子":"巳",
            "辰":"巳",

            "亥":"申",
            "卯":"申",
            "未":"申",

            "寅":"亥",
            "午":"亥",
            "戌":"亥",

            "巳":"寅",
            "酉":"寅",
            "丑":"寅"
    ]

    //亡神-五行禄地
    static def wangshen=[
            "申":"亥",
            "子":"亥",
            "辰":"亥",

            "亥":"寅",
            "卯":"寅",
            "未":"寅",

            "寅":"巳",
            "午":"巳",
            "戌":"巳",

            "巳":"申",
            "酉":"申",
            "丑":"申"
    ]


}