package com.lzy.core


/**
 *  神煞相关的算法
 * Created by bukeyan on 2017/6/18.
 */
class ShenShaAlgorithm {


    /**
     *  梁相润用年柱地支
     *
     */
    //孤辰
    static def guchen =[
            "亥":"寅",
            "子":"寅",
            "丑":"寅",

            "寅":"巳",
            "卯":"巳",
            "辰":"巳",

            "巳":"申",
            "午":"申",
            "未":"申",

            "申":"亥",
            "酉":"亥",
            "戌":"亥"
    ]

    //寡宿
    static def guasu =[
            "亥":"戌",
            "子":"戌",
            "丑":"戌",

            "寅":"丑",
            "卯":"丑",
            "辰":"丑",

            "巳":"辰",
            "午":"辰",
            "未":"辰",

            "申":"未",
            "酉":"未",
            "戌":"未"

    ]

    //大耗，地支对冲的左右两支
    static  dahao=[
            "亥":"辰午",
            "子":"巳未",
            "丑":"午申",

            "寅":"未酉",
            "卯":"申戌",
            "辰":"酉亥",

            "巳":"戌子",
            "午":"亥丑",
            "未":"子寅",

            "申":"丑卯",
            "酉":"寅辰",
            "戌":"卯巳"

    ]

//    static def dahao=[
//            "亥":["辰","午"],
//            "子":["巳","未"],
//            "丑":["午","申"],
//
//            "寅":["未","酉"],
//            "卯":["申","戌"],
//            "辰":["酉","亥"],
//
//            "巳":["戌","子"],
//            "午":["亥","丑"],
//            "未":["子","寅"],
//
//            "申":["丑","卯"],
//            "酉":["寅","辰"],
//            "戌":["卯","巳"]
//
//    ]

    //五虎遁禄干
    def dunlugan=["甲":"丙","乙":"己","丙":"癸","丁":"丙"
                     ,"戊":"丁","己":"庚",
                     "庚":"甲","辛":"丁","壬":"辛","癸":"甲"]
    //天乙贵人
    def tianyigui=["甲":"丑未" ,"戊":"丑未" ,"庚":"丑未",
                   "乙":"子申" ,"己":"子申" ,
                   "丙":"亥酉" ,"丁":"亥酉" ,
                   "壬":"巳卯" ,"癸":"巳卯" ,
                   "辛":"午寅"]

    /**
     *  梁相润用日支
     * [2017-08-15 add by longzhiyou]
     */
    //驿马
   static def yima =[
           "申":"寅",
           "子":"寅",
           "辰":"寅",

           "亥":"巳",
           "卯":"巳",
           "未":"巳",

           "寅":"申",
           "午":"申",
           "戌":"申",

           "巳":"亥",
           "酉":"亥",
           "丑":"亥"
    ]

    //劫杀-五行绝地
    static def jiesha=[
            "申":"巳",
            "子":"巳",
            "辰":"巳",

            "亥":"申",
            "卯":"申",
            "未":"申",

            "寅":"亥",
            "午":"亥",
            "戌":"亥",

            "巳":"寅",
            "酉":"寅",
            "丑":"寅"
    ]

    //亡神-五行禄地
    static def wangshen=[
            "申":"亥",
            "子":"亥",
            "辰":"亥",

            "亥":"寅",
            "卯":"寅",
            "未":"寅",

            "寅":"巳",
            "午":"巳",
            "戌":"巳",

            "巳":"申",
            "酉":"申",
            "丑":"申"
    ]




}